---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.FailedToStoreSideFace
source: html/7574c317-03f9-d430-77e7-e4bb5120fac5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.FailedToStoreSideFace Property

Failed to store wall side face. Wall sweeps on this wall will fail to regenerate.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedToStoreSideFace { get; }
```